#+TITLE: My Doom Emacs Config
#+PROPERTY: header-args :tangle config.el
#+AUTHOR: kageura30outlook

* Auto tangle
#+begin_src emacs-lisp
(defun config-org-auto-tangle ()
  (when (string-equal (buffer-file-name)
                      (expand-file-name "~/.doom.d/config.org"))
    (org-babel-tangle)))

(add-hook 'after-save-hook #'config-org-auto-tangle)

#+end_src

#+RESULTS:
| doom-modeline-update-vcs | doom-modeline-update-buffer-file-name | config-org-auto-tangle | (closure (t) nil (if (and (buffer-file-name) (string-match-p org-roam (buffer-file-name))) (progn (org-roam-db-sync)))) | +evil-display-vimlike-save-message-h | doom-auto-revert-buffers-h | doom-guess-mode-h |
